Tekla.Structures.Datatype.IntegerConverter
The IntegerConverter class converts types to and from the integer datatype.

Tekla.Structures.Datatype.IntegerConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the integer datatype.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.IntegerConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the integer datatype to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.IntegerConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the Tekla.Structures.Datatype.Integer type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new integer datatype object.

Tekla.Structures.Datatype.IntegerConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the the integer datatype to the given destination type.
context: The context.
culture: The target culture.
value: The integer datatype object to be converted.
destinationType: The destination type.
Returns: The given integer datatype object converted to the new type.